# Numpy Data Example

In [12]:
import numpy as np
import pandas as pd

In [10]:
# Weekly sales for snacks
np.random.seed(0)

weekly_sales = np.random.randint(0, 30, size=(7, 4))
weekly_sales

array([[12, 15, 21,  0],
       [ 3, 27,  3,  7],
       [ 9, 19, 21, 18],
       [ 4, 23,  6, 24],
       [24, 12, 26,  1],
       [ 6,  7, 23, 14],
       [24, 17,  5, 25]])

In [15]:
weekly_sales_df = pd.DataFrame(weekly_sales, 
                              index=["Mon", "Tue", "Wed", "Thur", "Fri", "Sat", "Sun"],
                              columns=["Fish Pie", "Puff Puff", "Egg Roll", "Donut"])
weekly_sales_df

      Fish Pie  Puff Puff  Egg Roll  Donut
Mon         12         15        21      0
Tue          3         27         3      7
Wed          9         19        21     18
Thur         4         23         6     24
Fri         24         12        26      1
Sat          6          7        23     14
Sun         24         17         5     25

In [30]:
price_for_snack = np.array([50, 20, 200, 150])
price_for_snack

array([ 50,  20, 200, 150])

In [32]:
price_for_snack_df = pd.DataFrame(price_for_snack.reshape(1, 4),
                                  index=["Price for snacks"], 
                                  columns=["Fish Pie", "Puff Puff", "Egg Roll", "Donut"])
price_for_snack_df

                  Fish Pie  Puff Puff  Egg Roll  Donut
Price for snacks        50         20       200    150

In [33]:
weekly_sales_df

      Fish Pie  Puff Puff  Egg Roll  Donut
Mon         12         15        21      0
Tue          3         27         3      7
Wed          9         19        21     18
Thur         4         23         6     24
Fri         24         12        26      1
Sat          6          7        23     14
Sun         24         17         5     25

In [38]:
total_sale = price_for_snack_df.dot(np.transpose(weekly_sales_df))
total_sale

                   Mon   Tue   Wed  Thur   Fri   Sat   Sun
Price for snacks  5100  2340  7730  5460  6790  7140  6290

In [43]:
weekly_sales_df["Total Snack Sales $"] = np.transpose(total_sale)
weekly_sales_df

      Fish Pie  Puff Puff  Egg Roll  Donut  Total Snack Sales $
Mon         12         15        21      0                 5100
Tue          3         27         3      7                 2340
Wed          9         19        21     18                 7730
Thur         4         23         6     24                 5460
Fri         24         12        26      1                 6790
Sat          6          7        23     14                 7140
Sun         24         17         5     25                 6290